examples/channel/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;

startTime       0.0;

stopAt          endTime;

deltaT          0.001;

endTime         0.1;

writeControl    adjustableRunTime;

writeInterval   0.005;

purgeWrite      0;

adjustTimeStep  yes;

maxCo           1.0;

maxAlphaCo      1.0;

writeFormat     ascii;

writePrecision  6;

runTimeModifiable true;

functions
{
	#includeFunc probes
	#includeFunc surfaces
}
// ************************************************************************* //
