examples/channel/0_org/U
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.0 0.0 0.0);

boundaryField
{

    outlet
    {
        type        pressureInletOutletVelocity;
        value       $internalField;
    }

    inlet
    {
	    type	timeVaryingMappedFixedValue;
	    setAverage	false;
	    offset	(0 0 0);
	    mapMethod	planarInterpolation; // nearestCell
    }

    wall
    {
        // movingWallVelocity reduces to fixedValue if the mesh is not moving
        type        movingWallVelocity;
        value       uniform (0 0 0);
    }

    defaultFaces
    {
        type        slip;
        value       $internalField;
    }

}

// ************************************************************************* //
