examples/channel/0_org/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
40000
(
0.00068185
0.000676998
0.000222678
0.000222108
0.00067452
0.00114509
0.00164057
0.00215621
...
)
;

boundaryField
{
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
0.00067363
0.000672199
0.000669779
0.000669455
0.000668947
0.000669231
0.000669272
0.000669406
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
0.000673633
0.000672202
0.000669781
0.000669455
0.000668947
0.00066923
0.000669271
0.000669405
...
)
;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
8000
(
0.00067363
0.00114434
0.00163903
0.00215341
0.00267735
0.0032025
0.00372248
0.00423656
...
)
;
    }
}


// ************************************************************************* //
