examples/channel/system/turbulenceLib
"libturbulenceModels.so"
